sentence = "Загальна довжина представників цього роду коливається від 3 до 12 м, " \
           "деякі часом досягають маси 100 кг. Голова розширена в основі й чітко відокремлена від тулуба. " \
           "На міжщелеповому й верхньогубних щитках добре помітні 2-4 глибоких ямки. " \
           "Зіниці вертикальні. З боків від анального щитка розташовуються невеликі вирости — рудименти задніх " \
           "кінцівок."\
           "Забарвлення дуже різнокольорове: коричневе, оливкове, жовтувате, буре з різними відтінками. " \
           "На спині та з боків часто розташовані плями або цятки різної форми та розміру."

number = sentence.count('.!?') + sentence.count(".")

print("Кількість речень у тексті: ", number)
