"""Перше завдання на добуток"""
a = int(input("Введіть перше число"))
b = int(input("Введіть друге число"))
c = int(input("Введіть третє число"))
print("Результат добутку:", a * b * c)
"""Перше завдання на додавання"""
a = int(input("Введіть перше число"))
b = int(input("Введіть друге число"))
c = int(input("Введіть третє число"))
print("Результат додавання:", a + b + c)
"""Друге завдання"""
a = int(input("Введіть зарплату за місяць"))
b = int(input("Введіть сумму місячного платежу за кредитом банку"))
c = int(input("заборгованість за комунальні послуги"))
print("Сумма яка залишиться на руках", a - b - c)
"""Третє завдання"""
a = float(input("Довжина першої діагоналі"))
b = float(input("Довжина другої діагоналі"))
c = 2
print(a * b / c)
"""Четверте завдання"""
print("To be \nor not \nto be")
"""П'яте завдання"""
print('"Life is what happens \n\twhen\n\t\tyou\'re busy making other plans"\n\t\t\t\t\t\t\tJohn Lennon')
